<!-- placeholder-1 -->
```fish
terraform plan -chdir=./
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 25 to add, 0 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @tonitert at 2025-08-01T23:26:18Z [(view log)](https://github.com/tonitert/ad-infra-k3s/actions/runs/16687126056/job/47238630514#step:6:1).
</summary>

```hcl

Error: Invalid provider configuration

Provider "registry.terraform.io/integrations/github" requires explicit
configuration. Add a provider block to the root module and configure the
provider's required arguments as described in the provider documentation.


Error: Error

  with provider["registry.terraform.io/integrations/github"],
  on <empty> line 0:
  (source code not available)

GET https://api.github.com/user: 403 Resource not accessible by integration
[]
8242a24c03f7d96ea4f2e5884098]
hcloud_primary_ip.primary_ip_ad_server: Refreshing state... [id=96514078]
module.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...
module.kube-hetzner.data.hcloud_servers.autoscaled_nodes["autoscaled-small"]: Reading...
module.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...
module.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 1s
module.kube-hetzner.data.hcloud_servers.autoscaled_nodes["autoscaled-small"]: Read complete after 1s [id=da39a3ee5e6b4b0d3255bfef95601890afd80709]
module.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # tls_private_key.ad_server_key will be destroyed
  # (because tls_private_key.ad_server_key is not in configuration)
  - resource "tls_private_key" "ad_server_key" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "032310c7facc07542eaeb843effc6cd55c7a8b28" -> null
      - private_key_openssh           = (sensitive value) -> null
      - private_key_pem               = (sensitive value) -> null
      - private_key_pem_pkcs8         = (sensitive value) -> null
      - public_key_fingerprint_md5    = "53:04:1a:3d:4e:95:33:6c:3b:3a:2d:13:1c:a6:6e:73" -> null
      - public_key_fingerprint_sha256 = "SHA256:SkEwt4Q/b3HrKi2TrXgX9eFPdLINs6AipMmh2ft92os" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDRaGF2BRQUPY/VTDT2mUjpzMNZu9xO9QLlS+nbX408NZydKcDXeP+aXgI3UwcPrk8h9RMkpDETYQt1k4OHV3MZG2JnyLRpXNU4fKAJDIUUywMSp/GK2Vp8UlD5NtqS8iNocOqy5eLic/4MHJHHcZ2q8plCls7HQqt9V4v5ZLf9RgAj1sRD1jEzNjVI4Ss1DJDzfADdr6+fn01rp3sPKJsM9Z2EszKsq87q5nGgr6SlrlXEeUSQnPmbGtCKIb1zMi8fuNnQYrhh1N/RrNCCUyGSuo3UIlrBlfiOpSvSLn8ukQ0zkSlWQLk0qPz3sKAPaFV+Gk41jZnBA7yRO2IlVAjKKQW+j9FXP7qgN96VNlZGy4J3MRhC8zX1akjz+jfAuBH36YV00ptbWnjuQe6CY9+MFSq//XqbQvg1o6ZjYiHAVauMRqlhlRwSiXKVzh4l+wFzglNr9PS1VIiTICVuiEQC8hJwfRpB9QJhWhi9Vlc8XeM2Y1rTN6Bsva6TcRWLaJVzBeKJD7SalAdau+Ln0L8gvuOUp/QnS/khrJebH1rhZQm+BSzgTehvclSbkm3rn+7zhP1Wr95JTbHeSbSVZdmWidv/W1g6KjtqlDEe/3DHrBWA4qH6BNO/SfzYR4FyW4I4KbIpsVRCMpa9NeltFQxPOdjfIf7zLMyVHh2jyRsYEw==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA0WhhdgUUFD2P1Uw09plI
            6czDWbvcTvUC5Uvp21+NPDWcnSnA13j/ml4CN1MHD65PIfUTJKQxE2ELdZODh1dz
            GRtiZ8i0aVzVOHygCQyFFMsDEqfxitlafFJQ+TbakvIjaHDqsuXi4nP+DByRx3Gd
            qvKZQpbOx0KrfVeL+WS3/UYAI9bEQ9YxMzY1SOErNQyQ83wA3a+vn59Na6d7Dyib
            DPWdhLMyrKvO6uZxoK+kpa5VxHlEkJz5mxrQiiG9czIvH7jZ0GK4YdTf0azQglMh
            krqN1CJawZX4jqUr0i5/LpENM5EpVkC5NKj897CgD2hVfhpONY2ZwQO8kTtiJVQI
            yikFvo/RVz+6oDfelTZWRsuCdzEYQvM19WpI8/o3wLgR9+mFdNKbW1p47kHugmPf
            jBUqv/16m0L4NaOmY2IhwFWrjEapYZUcEolylc4eJfsBc4JTa/T0tVSIkyAlbohE
            AvIScH0aQfUCYVoYvVZXPF3jNmNa0zegbL2uk3EVi2iVcwXiiQ+0mpQHWrvi59C/
            IL7jlKf0J0v5IayXmx9a4WUJvgUs4E3ob3JUm5Jt65/u84T9Vq/eSU2x3km0lWXZ
            lonb/1tYOio7apQxHv9wx6wVgOKh+gTTv0n82EeBcluCOCmyKbFUQjKWvTXpbRUM
            TznY3yH+8yzMlR4do8kbGBMCAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

  # module.kube-hetzner.data.cloudinit_config.autoscaler_config[0] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "autoscaler_config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (sensitive value)
          + content_type = "text/cloud-config"
          + filename     = "init.cfg"
        }
    }

  # module.kube-hetzner.data.hcloud_network.k3s will be read during apply
  # (config refers to values not yet known)
 <= data "hcloud_network" "k3s" {
      + delete_protection        = (known after apply)
      + expose_routes_to_vswitch = (known after apply)
      + id                       = (known after apply)
      + ip_range                 = (known after apply)
      + labels                   = (known after apply)
      + name                     = (known after apply)
    }

  # module.kube-hetzner.hcloud_firewall.k3s will be created
  + resource "hcloud_firewall" "k3s" {
      + id     = (known after apply)
      + labels = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + name   = "k3s"

      + rule {
          + description     = "Allow Incoming ICMP Ping Requests"
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
            # (1 unchanged attribute hidden)
        }
      + rule {
          + description     = "Allow Incoming Requests to Kube API Server"
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "Allow Incoming SSH Traffic"
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "Allow Outbound HTTP Requests"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + port            = "80"
          + protocol        = "tcp"
          + source_ips      = []
        }
      + rule {
          + description     = "Allow Outbound HTTPS Requests"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + port            = "443"
          + protocol        = "tcp"
          + source_ips      = []
        }
      + rule {
          + description     = "Allow Outbound ICMP Ping Requests"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + protocol        = "icmp"
          + source_ips      = []
            # (1 unchanged attribute hidden)
        }
      + rule {
          + description     = "Allow Outbound TCP DNS Requests"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + port            = "53"
          + protocol        = "tcp"
          + source_ips      = []
        }
      + rule {
          + description     = "Allow Outbound UDP DNS Requests"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + port            = "53"
          + protocol        = "udp"
          + source_ips      = []
        }
      + rule {
          + description     = "Allow Outbound UDP NTP Requests"
          + destination_ips = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + direction       = "out"
          + port            = "123"
          + protocol        = "udp"
          + source_ips      = []
        }
    }

  # module.kube-hetzner.hcloud_load_balancer.cluster[0] will be created
  + resource "hcloud_load_balancer" "cluster" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + load_balancer_type = "lb11"
      + location           = "hel1"
      + name               = "k3s-traefik"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm {
          + type = "round_robin"
        }

      + target (known after apply)
    }

  # module.kube-hetzner.hcloud_load_balancer_network.cluster[0] will be created
  + resource "hcloud_load_balancer_network" "cluster" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = "10.0.0.254"
      + load_balancer_id        = (known after apply)
      + subnet_id               = (known after apply)
    }

  # module.kube-hetzner.hcloud_load_balancer_target.cluster[0] will be created
  + resource "hcloud_load_balancer_target" "cluster" {
      + id               = (known after apply)
      + label_selector   = "cluster=k3s,engine=k3s,provisioner=terraform,role in (control_plane_node,agent_node)"
      + load_balancer_id = (known after apply)
      + type             = "label_selector"
      + use_private_ip   = true
    }

  # module.kube-hetzner.hcloud_network.k3s[0] will be created
  + resource "hcloud_network" "k3s" {
      + delete_protection        = false
      + expose_routes_to_vswitch = false
      + id                       = (known after apply)
      + ip_range                 = "10.0.0.0/8"
      + labels                   = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + name                     = "k3s"
    }

  # module.kube-hetzner.hcloud_network_subnet.agent[0] will be created
  + resource "hcloud_network_subnet" "agent" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.0.0.0/18"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # module.kube-hetzner.hcloud_network_subnet.control_plane[0] will be created
  + resource "hcloud_network_subnet" "control_plane" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.64.0.0/18"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # module.kube-hetzner.hcloud_network_subnet.peripherals will be created
  + resource "hcloud_network_subnet" "peripherals" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "10.128.0.0/10"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "cloud"
    }

  # module.kube-hetzner.hcloud_placement_group.agent[0] will be created
  + resource "hcloud_placement_group" "agent" {
      + id      = (known after apply)
      + labels  = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + name    = "k3s-agent-1"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.kube-hetzner.hcloud_placement_group.control_plane[0] will be created
  + resource "hcloud_placement_group" "control_plane" {
      + id      = (known after apply)
      + labels  = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + name    = "k3s-control-plane-1"
      + servers = (known after apply)
      + type    = "spread"
    }

  # module.kube-hetzner.hcloud_ssh_key.k3s[0] will be created
  + resource "hcloud_ssh_key" "k3s" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + labels      = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
        }
      + name        = "k3s"
      + public_key  = <<-EOT
            -----BEGIN OPENSSH PRIVATE KEY-----
            b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAAAMwAAAAtzc2gtZW
            QyNTUxOQAAACC2orqRjZMNhs2+gHAraQfToWLueYQRhfaiI4elwyo/kAAAAJjT5Lvk0+S7
            5AAAAAtzc2gtZWQyNTUxOQAAACC2orqRjZMNhs2+gHAraQfToWLueYQRhfaiI4elwyo/kA
            AAAEDrdzXFlEeIPrdO2oCNxtJ1Z5dOoLaEWc8oLAgdOc2uibaiupGNkw2Gzb6AcCtpB9Oh
            Yu55hBGF9qIjh6XDKj+QAAAAEXRvbml0QFRvbmkyMDE3LVBDAQIDBA==
            -----END OPENSSH PRIVATE KEY-----
        EOT
    }

  # module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-hel1"] will be created
  + resource "null_resource" "authentication_config" {
      + id       = (known after apply)
      + triggers = {
          + "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          + "control_plane_id"      = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.configure_autoscaler[0] will be created
  + resource "null_resource" "configure_autoscaler" {
      + id       = (known after apply)
      + triggers = {
          + "template" = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-hel1"] will be created
  + resource "null_resource" "control_plane_config" {
      + id       = (known after apply)
      + triggers = {
          + "config"           = (sensitive value)
          + "control_plane_id" = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.control_planes["0-0-control-plane-hel1"] will be created
  + resource "null_resource" "control_planes" {
      + id       = (known after apply)
      + triggers = {
          + "control_plane_id" = (known after apply)
        }
    }

  # module.kube-hetzner.null_resource.first_control_plane will be created
  + resource "null_resource" "first_control_plane" {
      + id = (known after apply)
    }

  # module.kube-hetzner.random_password.k3s_token will be created
  + resource "random_password" "k3s_token" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.kube-hetzner.random_password.rancher_bootstrap[0] will be created
  + resource "random_password" "rancher_bootstrap" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 48
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.kube-hetzner.ssh_sensitive_resource.kubeconfig will be created
  + resource "ssh_sensitive_resource" "kubeconfig" {
      + agent                              = (sensitive value)
      + bastion_port                       = "22"
      + commands                           = [
          + "cat /etc/rancher/k3s/k3s.yaml",
        ]
      + commands_after_file_changes        = true
      + host                               = (known after apply)
      + id                                 = (known after apply)
      + ignore_no_supported_methods_remain = false
      + port                               = "22"
      + private_key                        = (sensitive value)
      + result                             = (sensitive value)
      + retry_delay                        = "10s"
      + timeout                            = "15m"
      + user                               = "root"
      + when                               = "create"
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
          + filename     = "init.cfg"
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "306553279"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster"     = "k3s"
          + "engine"      = "k3s"
          + "provisioner" = "terraform"
          + "role"        = "control_plane_node"
        }
      + location                   = "hel1"
      + name                       = (known after apply)
      + placement_group_id         = (known after apply)
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.64.0.101"
          + mac_address = (known after apply)
          + network_id  = (known after apply)
        }

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.os_upgrade_toggle will be created
  + resource "null_resource" "os_upgrade_toggle" {
      + id       = (known after apply)
      + triggers = {
          + "os_upgrade_state" = "enabled"
          + "server_id"        = (known after apply)
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.registries will be created
  + resource "null_resource" "registries" {
      + id       = (known after apply)
      + triggers = {
          + "registries" = " "
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].null_resource.zram will be created
  + resource "null_resource" "zram" {
      + id       = (known after apply)
      + triggers = {
          + "zram_size" = null
        }
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].random_string.identity_file will be created
  + resource "random_string" "identity_file" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].random_string.server will be created
  + resource "random_string" "server" {
      + id          = (known after apply)
      + keepers     = {
          + "name" = "k3s-control-plane-hel1"
        }
      + length      = 3
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 25 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + kubeconfig = (sensitive value)
```
</details>
<!-- placeholder-5 -->
<!-- terraform-6-6afb9c8c5ee97daa270f990874b8eec7.tfplan -->
<!-- placeholder-6 -->